Repository: forth32/balongflash
Catalog: po/*.po
Languages: ru

source: Flasher tool for USB-modems on Balong V7 chipset %s [option] <file or directory> options: -p <tty> - bootloader serial port%s -n - flash multiple files from directory -g# - digital signature mode (use '-gl' to list modes) -m - print firmware map and exit -e - split firmware by partitions without headers -s - split firmware by partitions with headers -k - do not reboot modem after flashing -r - reboot modem without flashing -f - ignore CRC errors in firmware file
ru: Утилита предназначена для прошивки модемов на чипсете Balong V7 %s [ключи] <имя файла для загрузки или имя каталога с файлами> допустимы следующие ключи: -p <tty> - последовательный порт для общения с загрузчиком%s -n - режим мультифайловой прошивки из указанного каталога -g# - установка режима цифровой подписи (-gl - описание параметров) -m - вывести карту файла прошивки и завершить работу -e - разобрать файл прошивки на разделы без заголовков -s - разобрать файл прошивки на разделы с заголовками -k - не перезагружать модем по окончании прошивки -r - принудительно перезагрузить модем без прошивки разделов -f - прошить даже при наличии ошибок CRC в исходном файле

source: (default is /dev/ttyUSB0)
ru: (по умолчанию /dev/ttyUSB0)

source: Flasher tool for Balong-based devices, V3.0.%i, (c) forth32, 2015, GNU GPLv3
ru: Программа для прошивки устройств на Balong-чипсете, V3.0.%i, (c) forth32, 2015, GNU GPLv3

source: Windows 32bit port (c) rust3028, 2016
ru: Порт для Windows 32bit (c) rust3028, 2016

source: Options -s and -e are incompatiple
ru: Ключи -s и -e несовместимы

source: Options -k and -r are incompatiple
ru: Ключи -k и -r несовместимы

source: Option -n is not compatible with options -s, -m and -e
ru: Ключ -n несовместим с ключами -s, -m и -e

source: - Directory is missing
ru: - Не указан каталог с файлами

source: - Filename is missing, use -h for help
ru: - Не указано имя файла для загрузки, используйте ключ -h для подсказки

source: Cannot open %s
ru: Ошибка открытия %s

source: ! Errors in input file - quitting
ru: ! Входной файл содержит ошибки - завершаем работу

source: Modem is already in HDLC-mode
ru: Модем уже находится в HDLC-режиме

source: - command timeout
ru: - таймаут команды

source: - error code %02x
ru: - код ошибки %02x

source: ## --- Partition name --- written
ru: ## ---- Имя раздела ---- записано

source: ! Partition %i (%s) header rejected
ru: ! Отвергнут заголовок раздела %i (%s)

source: ! Partition %i (%s) block %i rejected
ru: ! Раздел %i (%s): отвергнут блок %i

source: ! Error closing partition %i (%s)
ru: ! Ошибка закрытия раздела %i (%s)

source: Error writing command
ru: Ошибка записи команды

source: Modem answer is too short: %i bytes, expected %i bytes
ru: Слишком короткий ответ от модема: %i байт, ожидалось %i байт

source: ! - Cannot open serial port %s
ru: ! - Последовательный порт %s не открывается

source: Cannot open directory %s
ru: Каталог %s не открывается

source: Invalid filename format - %s
ru: Неправильный формат имени файла - %s

source: Invalid parition identifier - non-digit character - %s
ru: Ошибка в идентификаторе раздела - нецифровой знак - %s

source: Error opening file %s
ru: Ошибка открытия файла %s

source: Error reading file %s
ru: Ошибка чтения файла %s

source: File %s has a header - cannot flash
ru: Файл %s имеет заголовок - для прошивки не подходит

source: Searching for serial port...
ru: Поиск прошивочного порта...

source: Port: "%s"
ru: Порт: "%s"

source: Port not found!
ru: Порт не обнаружен!

source: ! - Cannot open serial port COM%s
ru: ! - Последовательный порт COM%s не открывается

source: ! - Serial port initialization failed
ru: ! - Ошибка при инициализации COM-порта

source: ! Partition %s (%02x) - header checksum error
ru: ! Раздел %s (%02x) - ошибка контрольной суммы заголовка

source: ! Partition %s (%02x) - invalid checksum block size
ru: ! Раздел %s (%02x) - неправильный размер блока контрольных сумм

source: ! Partition %s (%02x) - invalid checksum block
ru: ! Раздел %s (%02x) - неправильная блочная контрольная сумма

source: ! Error uncompressing partition %s (%02x)
ru: ! Ошибка распаковки раздела %s (%02x)

source: Unable to find partitions - file does not contain a firmware image
ru: В файле не найдены разделы - файл не содержит образа прошивки

source: Invalid file header size
ru: Заголовок файла имеет неправильный размер

source: Firmare file code: %i (0x%x)
ru: Код файла прошивки: %i (0x%x)

source: Searching for partition files... ## Size ID Name File -----------------------------------------------------------------
ru: Поиск файлов-образов разделов... ## Размер ID Имя Файл -----------------------------------------------------------------

source: ! Error allocating memory, partition #%i, size = %i bytes
ru: ! Ошибка распределения памяти, раздел #%i, размер = %i байт

source: Error opening %s
ru: Ошибка открытия файла %s

source: ! No partition files found in directory %s
ru: ! Не найдено ни одного файла с образом раздела в каталоге %s

source: Main firmware
ru: Основная прошивка

source: E3372s-stick firmware
ru: Прошивка E3372s-stick

source: WebUI+ISO for HLINK modem
ru: Вебинтерфейс+ISO для HLINK-модема

source: ISO (dashboard) for stick modem
ru: ISO (dashboard) для stick-модема

source: Firmware+ISO+WebUI
ru: Прошивка+ISO+вебинтерфейс

source: Universal
ru: универсальная

source: # length type description --------------------------------------
ru: # длина тип описание --------------------------------------

source: Custom signature parameters can be specified in the following format: -g *,type,len
ru: Также можно указать произвольные параметры подписи в формате: -g *,type,len

source: -g can be specified only once
ru: Дублирующийся ключ -g

source: -g: unknown firmware type - %i
ru: Ключ -g: неизвестный тип прошивки - %i

source: Digital signature mode: %s (%i bytes)
ru: Режим цифровой подписи: %s (%i байт)

source: Invalid -g parameters
ru: Ошибка в параметрах ключа -g

source: ! Digital signature verification failed - %02x
ru: ! Ошибка проверки цифровой сигнатуры - %02x

source: ! Invalid firmare monitor version - [%i]%s
ru: ! Неправильная версия монитора прошивки - [%i]%s

source: Extracting partitions from firmware file: ## Offset Size Name -------------------------------------
ru: Выделение разделов из файла прошивки: ## Смещение Размер Имя -------------------------------------

source: Invalid answer length to ^DATAMODE
ru: Неправильная длина ответа на ^DATAMODE

source: ^DATAMODE command rejected, setting digital signature mode may be required
ru: Команда ^DATAMODE отвергнута, возможно требуется режим цифровой подписи

source: No answer from modem in HDLC-mode
ru: Нет ответа от модема в HDLC-режиме

source: Error getting protocol version
ru: Ошибка получения версии протокола

source: Protocol version: %s
ru: Версия протокола: %s

source: Rebooting modem...
ru: Перезагрузка модема...

source: Device identifier: %s
ru: Идентификатор устройства: %s

source: ## Offset Size Compr. Name -------------------------------------
ru: ## Смещение Размер Сжатие Имя -------------------------------------

source: Firmware version: %s
ru: Версия прошивки: %s

source: Platform: %s
ru: Платформа: %s

source: Build date: %s %s
ru: Дата сборки: %s %s

source: Header: version %i, compatibility code: %8.8s
ru: Заголовок: версия %i, код соответствия: %8.8s
